import numpy as np
# [기본 제공 코드] CSV 파일 로드 (헤더 제외, 콤마 구분)
data = np.genfromtxt('./day1027/경찰청_범죄 발생시간_20251231.csv', delimiter=',', skip_header=1,encoding="utf-8")
#죄종 대분류,죄종 소분류,00_00-02_59,03_00-05_59,06_00-08_59,09_00-11_59,12_00-14_59,15_00-17_59,18_00-20_59,21_00-23_59,미상
print(f"데이터 형태: {data.shape}")

#1.강력범죄
#1-1.시간별 합계
강력시간별합계 = []
for col in range(2, 10):
    합계 = np.sum(data[0:8, col].astype(int))
    강력시간별합계.append(합계)

강력시간별합계 = np.array(강력시간별합계)
print("시간별 합계 평균:", np.mean(강력시간별합계))
print("시간대별 합계:", 강력시간별합계)
강력최다시간 = np.max(강력시간별합계)
print("최다 범죄 발생 시간대 범죄건수:",강력최다시간)

#1-2.시간별 평균
강력시간별평균=강력시간별합계/8
강력최대평균=np.max(강력시간별평균)
print("강력범죄 시간대별 평균:", 강력시간별평균)
#1-2-1.전체 시간대 평균 비교 그룹화
print("강력범죄 위험 시간대:",강력시간별평균>np.mean(강력시간별평균))

# 2. 정규화
강력정규화 = (강력시간별합계 - np.min(강력시간별합계)) / (np.max(강력시간별합계) - np.min(강력시간별합계))
print( "정규화 결과:",np.round(강력정규화, 3))



