# 샘플 데이터
import pandas as pd
raw_data = [
    {'사번': 25001, '이름': ' 김철수 ', '나이': 20.0, '부서': '정보보호부', '입사일': '2022-03-02'},
    {'사번': 25001, '이름': ' 김철수 ', '나이': 20.0, '부서': '정보보호부', '입사일': '2022-03-02'},  # 완전 중복 행
    {'사번': 25002, '이름': '이영희', '부서': '기술부', '입사일': '2021-03-02'},               # 나이 키 누락 (NaN 결측)
    {'사번': 25003, '이름': '박민수', '나이': 22.0, '부서': '', '입사일': '2020-03-02'},      # 부서 빈 문자열 ('')
    {'사번': 25004, '이름': '정수진', '나이': 20.0, '부서': '전략본부', '입사일': '2022-03-02'},
    {'사번': 25005, '이름': '한미래', '나이': 23.0, '부서': '개발부', '입사일': '2019-03-02'},
    {'사번': 25005, '이름': '한미래', '나이': 23.0, '부서': '개발부', '입사일': '2019-03-02'},  # 완전 중복 행
    {'사번': 25006, '이름': ' 강동원 ', '나이': 25.0, '부서': '개발부', '입사일': '2018-07-15'},  # 이름 앞뒤 공백
    {'사번': 25007, '이름': '최유리', '부서': '기획부', '입사일': '2023-01-10'},               # 나이 키 누락
    {'사번': 25008, '이름': '조현우', '나이': 21.0, '부서': '   ', '입사일': '2021-08-20'},    # 부서 스페이스 공백 ('   ')
    {'사번': 25009, '이름': '윤서연', '나이': 24.0, '부서': '인사부', '입사일': '2020-11-05'},
    {'사번': 25010, '이름': ' 송민호 ', '나이': 22.0, '부서': '기술부', '입사일': '2022-05-12'},  # 이름 앞뒤 공백
    {'사번': 25011, '이름': '백지은', '부서': '전략본부', '입사일': '2023-04-03'},             # 나이 키 누락
    {'사번': 25012, '이름': '서동현', '나이': 26.0, '부서': '개발부', '입사일': '2017-09-01'},
    {'사번': 25013, '이름': '신아름', '나이': 21.0, '부서': '', '입사일': '2022-10-18'},      # 부서 빈 문자열
    {'사번': 25013, '이름': '신아름', '나이': 21.0, '부서': '', '입사일': '2022-10-18'},      # 중복 행
    {'사번': 25014, '이름': '오상우', '나이': 23.0, '부서': '정보보호부', '입사일': '2021-02-15'},
    {'사번': 25015, '이름': ' 임지선 ', '나이': 20.0, '부서': '기획부', '입사일': '2023-06-01'},  # 이름 앞뒤 공백
    {'사번': 25016, '이름': '하태웅', '나이': 24.0, '부서': '기술부', '입사일': '2019-12-20'},
    {'사번': 25017, '이름': '문채원', '부서': '개발부', '입사일': '2022-08-01'},               # 나이 키 누락
]

df = pd.DataFrame(raw_data)

df = df.drop_duplicates().reset_index(drop=True)

# 타입변환
# df['칼럼명'].astype(변환할 타입)
df['사번'] = df['사번'].astype(str)

# 문자열.strip() : 앞뒤 여백/공백 제거 함수
# 문자열.replace('기존문자','새로운문자') 문자열내 기본문자가 존재하면 새로운 문자로 치환
df['이름'] = df['이름'].str.strip()
df['부서'] = df['부서'].str.strip().replace('',None)

print(df.isnull().sum())

# df.dropna(axios=0 or 1) 
# 결측이 포함된 행or열 자체 제거
new_df=df.dropna(axis=0)
new_df.info()

# 결측값 채우기
# df['컬럼명'].fillna() : 표본 부족시 등 손실 막기위해 대표값 채움
df['나이'] = df['나이'].fillna(df['나이'].meadian())
df['부서'] = df['부서'].fillna(df['부서'].mode()[0]) # df['컬럼명'].mode()[0] : 최빈값

# 임계범위 기준으로( 최소~최댓값 ) 강제 조정
# .clip( lower= 최소값 , upper= 최대값 )
df['나이'] = df['나이'].clip(lower=18,upper=60)

bins = [ 0,20,30,40] # 구간
labels = ['청년기', '도약기','성숙기']
# 0~20 청년기 / 21~30 도약기 / 31~40 성숙기
df['연령그룹'] = pd.cut(df['나이'], bins = bins , labels= labels)
print(df)